/*
Medium: Завдання №2
Напишіть програму обчислення вартості покупки з урахуванням знижки.
Знижка в 3% надається, якщо сума покупки складає більше 500 гривень,
в 5% — якщо сума покупки складає більше 1000 гривень.

Приклад результату виконання програми:

Введіть суму покупки: 640
Вам надається знижка в 3%
Сума з урахуванням знижки: 620.80 грн.
*/
#include <iostream>
#include <iomanip>

using std::cin;
using std::cout;
using std::endl;

int main()
{
    float sum = 0;
    cout << "Введіть суму покупки:";
    cin >> sum;
    if (sum <= 999 && sum >= 500)
    {
        cout << "Вам надається знижка в 3%" << endl;
        cout << "Сума з урахуванням знижки: " << sum - ((sum * 3) / 100) << endl;
    }
    else if (sum >= 1000)
    {
        cout << "Вам надається знижка в 5%" << endl;
        cout << "Сума з урахуванням знижки: " << sum - ((sum * 5) / 100) << endl;
    }
    else if (sum < 500)
    {
        cout << "Вам не положена знижка" << endl;
        cout << "Сума до сплати: " << sum << endl;
    }

    return 0;
}